PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p18f67k40.inc
        LIST

;==========================================================================
; Build date : Feb 01 2016
;  MPASM PIC18F67K40 processor include
; 
;  (c) Copyright 1999-2016 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18F67K40 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18F67K40
;       2. LIST directive in the source file
;               LIST   P=PIC18F67K40
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18F67K40
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0             EQU  0
FSR1             EQU  1
FSR2             EQU  2

FAST             EQU  1

W                EQU  0
A                EQU  0
ACCESS           EQU  0
BANKED           EQU  1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
PPSLOCK          EQU  H'0DEF'
INT0PPS          EQU  H'0DF0'
INT1PPS          EQU  H'0DF1'
INT2PPS          EQU  H'0DF2'
INT3PPS          EQU  H'0DF3'
T0CKIPPS         EQU  H'0DF4'
T1CKIPPS         EQU  H'0DF5'
T1GPPS           EQU  H'0DF6'
T3CKIPPS         EQU  H'0DF7'
T3GPPS           EQU  H'0DF8'
T5CKIPPS         EQU  H'0DF9'
T5GPPS           EQU  H'0DFA'
T7CKIPPS         EQU  H'0DFB'
T7GPPS           EQU  H'0DFC'
T2INPPS          EQU  H'0DFD'
T4INPPS          EQU  H'0DFE'
T6INPPS          EQU  H'0DFF'
T8INPPS          EQU  H'0E00'
ADACTPPS         EQU  H'0E01'
CCP1PPS          EQU  H'0E02'
CCP2PPS          EQU  H'0E03'
CCP3PPS          EQU  H'0E04'
CCP4PPS          EQU  H'0E05'
CCP5PPS          EQU  H'0E06'
SMT1WINPPS       EQU  H'0E07'
SMT1SIGPPS       EQU  H'0E08'
SMT2WINPPS       EQU  H'0E09'
SMT2SIGPPS       EQU  H'0E0A'
CWG1PPS          EQU  H'0E0B'
CWGINPPS         EQU  H'0E0B'
MDCARLPPS        EQU  H'0E0C'
MDCARHPPS        EQU  H'0E0D'
MDSRCPPS         EQU  H'0E0E'
RX1PPS           EQU  H'0E0F'
TX1PPS           EQU  H'0E10'
RX2PPS           EQU  H'0E11'
TX2PPS           EQU  H'0E12'
RX3PPS           EQU  H'0E13'
TX3PPS           EQU  H'0E14'
RX4PPS           EQU  H'0E15'
TX4PPS           EQU  H'0E16'
RX5PPS           EQU  H'0E17'
TX5PPS           EQU  H'0E18'
SSP1CLKPPS       EQU  H'0E19'
SSP1DATPPS       EQU  H'0E1A'
SSP1SSPPS        EQU  H'0E1B'
SSP2CLKPPS       EQU  H'0E1C'
SSP2DATPPS       EQU  H'0E1D'
SSP2SSPPS        EQU  H'0E1E'
IPR0             EQU  H'0E1F'
IPR1             EQU  H'0E20'
IPR2             EQU  H'0E21'
IPR3             EQU  H'0E22'
IPR4             EQU  H'0E23'
IPR5             EQU  H'0E24'
IPR6             EQU  H'0E25'
IPR7             EQU  H'0E26'
IPR8             EQU  H'0E27'
IPR9             EQU  H'0E28'
PIE0             EQU  H'0E29'
PIE1             EQU  H'0E2A'
PIE2             EQU  H'0E2B'
PIE3             EQU  H'0E2C'
PIE4             EQU  H'0E2D'
PIE5             EQU  H'0E2E'
PIE6             EQU  H'0E2F'
PIE7             EQU  H'0E30'
PIE8             EQU  H'0E31'
PIE9             EQU  H'0E32'
PIR0             EQU  H'0E33'
PIR1             EQU  H'0E34'
PIR2             EQU  H'0E35'
PIR3             EQU  H'0E36'
PIR4             EQU  H'0E37'
PIR5             EQU  H'0E38'
PIR6             EQU  H'0E39'
PIR7             EQU  H'0E3A'
PIR8             EQU  H'0E3B'
PIR9             EQU  H'0E3C'
WDTCON0          EQU  H'0E3D'
WDTCON1          EQU  H'0E3E'
WDTL             EQU  H'0E3F'
WDTPS            EQU  H'0E3F'
WDTPSL           EQU  H'0E3F'
WDTH             EQU  H'0E40'
WDTPSH           EQU  H'0E40'
WDTPSU           EQU  H'0E41'
WDTU             EQU  H'0E41'
CPUDOZE          EQU  H'0E42'
OSCCON1          EQU  H'0E43'
OSCCON2          EQU  H'0E44'
OSCCON3          EQU  H'0E45'
OSCSTAT          EQU  H'0E46'
OSCSTAT1         EQU  H'0E46'
OSCEN            EQU  H'0E47'
OSCTUNE          EQU  H'0E48'
OSCFRQ           EQU  H'0E49'
VREGCON          EQU  H'0E4A'
BORCON           EQU  H'0E4B'
PMD0             EQU  H'0E4C'
PMD1             EQU  H'0E4D'
PMD2             EQU  H'0E4E'
PMD3             EQU  H'0E4F'
PMD4             EQU  H'0E50'
PMD5             EQU  H'0E51'
RA0PPS           EQU  H'0E52'
RA1PPS           EQU  H'0E53'
RA2PPS           EQU  H'0E54'
RA3PPS           EQU  H'0E55'
RA4PPS           EQU  H'0E56'
RA5PPS           EQU  H'0E57'
RA6PPS           EQU  H'0E58'
RA7PPS           EQU  H'0E59'
RB0PPS           EQU  H'0E5A'
RB1PPS           EQU  H'0E5B'
RB2PPS           EQU  H'0E5C'
RB3PPS           EQU  H'0E5D'
RB4PPS           EQU  H'0E5E'
RB5PPS           EQU  H'0E5F'
RB6PPS           EQU  H'0E60'
RB7PPS           EQU  H'0E61'
RC0PPS           EQU  H'0E62'
RC1PPS           EQU  H'0E63'
RC2PPS           EQU  H'0E64'
RC3PPS           EQU  H'0E65'
RC4PPS           EQU  H'0E66'
RC5PPS           EQU  H'0E67'
RC6PPS           EQU  H'0E68'
RC7PPS           EQU  H'0E69'
RD0PPS           EQU  H'0E6A'
RD1PPS           EQU  H'0E6B'
RD2PPS           EQU  H'0E6C'
RD3PPS           EQU  H'0E6D'
RD4PPS           EQU  H'0E6E'
RD5PPS           EQU  H'0E6F'
RD6PPS           EQU  H'0E70'
RD7PPS           EQU  H'0E71'
RE0PPS           EQU  H'0E72'
RE1PPS           EQU  H'0E73'
RE2PPS           EQU  H'0E74'
RE3PPS           EQU  H'0E75'
RE4PPS           EQU  H'0E76'
RE5PPS           EQU  H'0E77'
RE6PPS           EQU  H'0E78'
RE7PPS           EQU  H'0E79'
RF0PPS           EQU  H'0E7A'
RF1PPS           EQU  H'0E7B'
RF2PPS           EQU  H'0E7C'
RF3PPS           EQU  H'0E7D'
RF4PPS           EQU  H'0E7E'
RF5PPS           EQU  H'0E7F'
RF6PPS           EQU  H'0E80'
RF7PPS           EQU  H'0E81'
RG0PPS           EQU  H'0E82'
RG1PPS           EQU  H'0E83'
RG2PPS           EQU  H'0E84'
RG3PPS           EQU  H'0E85'
RG4PPS           EQU  H'0E86'
RG6PPS           EQU  H'0E88'
RG7PPS           EQU  H'0E89'
RH0PPS           EQU  H'0E8A'
RH1PPS           EQU  H'0E8B'
RH2PPS           EQU  H'0E8C'
RH3PPS           EQU  H'0E8D'
INLVLA           EQU  H'0E8E'
SLRCONA          EQU  H'0E8F'
ODCONA           EQU  H'0E90'
WPUA             EQU  H'0E91'
ANSELA           EQU  H'0E92'
IOCBF            EQU  H'0E93'
IOCBN            EQU  H'0E94'
IOCBP            EQU  H'0E95'
INLVLB           EQU  H'0E96'
SLRCONB          EQU  H'0E97'
ODCONB           EQU  H'0E98'
WPUB             EQU  H'0E99'
ANSELB           EQU  H'0E9A'
IOCCF            EQU  H'0E9B'
IOCCN            EQU  H'0E9C'
IOCCP            EQU  H'0E9D'
INLVLC           EQU  H'0E9E'
SLRCONC          EQU  H'0E9F'
ODCONC           EQU  H'0EA0'
WPUC             EQU  H'0EA1'
INLVLD           EQU  H'0EA3'
SLRCOND          EQU  H'0EA4'
ODCOND           EQU  H'0EA5'
WPUD             EQU  H'0EA6'
ANSELD           EQU  H'0EA7'
IOCEF            EQU  H'0EA8'
IOCEN            EQU  H'0EA9'
IOCEP            EQU  H'0EAA'
INLVLE           EQU  H'0EAB'
SLRCONE          EQU  H'0EAC'
ODCONE           EQU  H'0EAD'
WPUE             EQU  H'0EAE'
ANSELE           EQU  H'0EAF'
INLVLF           EQU  H'0EB0'
SLRCONF          EQU  H'0EB1'
ODCONF           EQU  H'0EB2'
WPUF             EQU  H'0EB3'
ANSELF           EQU  H'0EB4'
IOCGF            EQU  H'0EB5'
IOCGN            EQU  H'0EB6'
IOCGP            EQU  H'0EB7'
INLVLG           EQU  H'0EB8'
SLRCONG          EQU  H'0EB9'
ODCONG           EQU  H'0EBA'
WPUG             EQU  H'0EBB'
ANSELG           EQU  H'0EBC'
INLVLH           EQU  H'0EBD'
SLRCONH          EQU  H'0EBE'
ODCONH           EQU  H'0EBF'
WPUH             EQU  H'0EC0'
HLVDCON0         EQU  H'0EC2'
HLVDCON1         EQU  H'0EC3'
FVRCON           EQU  H'0EC4'
ZCDCON           EQU  H'0EC5'
DAC1CON0         EQU  H'0EC6'
DAC1CON1         EQU  H'0EC7'
CM3CON0          EQU  H'0EC8'
CM3CON1          EQU  H'0EC9'
CM3NCH           EQU  H'0ECA'
CM3PCH           EQU  H'0ECB'
CM2CON0          EQU  H'0ECC'
CM2CON1          EQU  H'0ECD'
CM2NCH           EQU  H'0ECE'
CM2PCH           EQU  H'0ECF'
CM1CON0          EQU  H'0ED0'
CM1CON1          EQU  H'0ED1'
CM1NCH           EQU  H'0ED2'
CM1PCH           EQU  H'0ED3'
CMOUT            EQU  H'0ED4'
SSP2BUF          EQU  H'0ED5'
SSP2ADD          EQU  H'0ED6'
SSP2MSK          EQU  H'0ED7'
SSP2STAT         EQU  H'0ED8'
SSP2CON1         EQU  H'0ED9'
SSP2CON2         EQU  H'0EDA'
SSP2CON3         EQU  H'0EDB'
RC5REG           EQU  H'0EDC'
RCREG5           EQU  H'0EDC'
TX5REG           EQU  H'0EDD'
TXREG5           EQU  H'0EDD'
SP5BRG           EQU  H'0EDE'
SP5BRGL          EQU  H'0EDE'
SPBRG5           EQU  H'0EDE'
SP5BRGH          EQU  H'0EDF'
SPBRGH5          EQU  H'0EDF'
RC5STA           EQU  H'0EE0'
RCSTA5           EQU  H'0EE0'
TX5STA           EQU  H'0EE1'
TXSTA5           EQU  H'0EE1'
BAUD5CON         EQU  H'0EE2'
BAUDCON5         EQU  H'0EE2'
BAUDCTL5         EQU  H'0EE2'
RC4REG           EQU  H'0EE3'
RCREG4           EQU  H'0EE3'
TX4REG           EQU  H'0EE4'
TXREG4           EQU  H'0EE4'
SP4BRG           EQU  H'0EE5'
SP4BRGL          EQU  H'0EE5'
SPBRG4           EQU  H'0EE5'
SP4BRGH          EQU  H'0EE6'
SPBRGH4          EQU  H'0EE6'
RC4STA           EQU  H'0EE7'
RCSTA4           EQU  H'0EE7'
TX4STA           EQU  H'0EE8'
TXSTA4           EQU  H'0EE8'
BAUD4CON         EQU  H'0EE9'
BAUDCON4         EQU  H'0EE9'
BAUDCTL4         EQU  H'0EE9'
RC3REG           EQU  H'0EEA'
RCREG3           EQU  H'0EEA'
TX3REG           EQU  H'0EEB'
TXREG3           EQU  H'0EEB'
SP3BRG           EQU  H'0EEC'
SP3BRGL          EQU  H'0EEC'
SPBRG3           EQU  H'0EEC'
SP3BRGH          EQU  H'0EED'
SPBRGH3          EQU  H'0EED'
RC3STA           EQU  H'0EEE'
RCSTA3           EQU  H'0EEE'
TX3STA           EQU  H'0EEF'
TXSTA3           EQU  H'0EEF'
BAUD3CON         EQU  H'0EF0'
BAUDCON3         EQU  H'0EF0'
BAUDCTL3         EQU  H'0EF0'
RC2REG           EQU  H'0EF1'
RCREG2           EQU  H'0EF1'
TX2REG           EQU  H'0EF2'
TXREG2           EQU  H'0EF2'
SP2BRG           EQU  H'0EF3'
SP2BRGL          EQU  H'0EF3'
SPBRG2           EQU  H'0EF3'
SP2BRGH          EQU  H'0EF4'
SPBRGH2          EQU  H'0EF4'
RC2STA           EQU  H'0EF5'
RCSTA2           EQU  H'0EF5'
TX2STA           EQU  H'0EF6'
TXSTA2           EQU  H'0EF6'
BAUD2CON         EQU  H'0EF7'
BAUDCON2         EQU  H'0EF7'
BAUDCTL2         EQU  H'0EF7'
SMT2TMR          EQU  H'0EF8'
SMT2TMRL         EQU  H'0EF8'
SMT2TMRH         EQU  H'0EF9'
SMT2TMRU         EQU  H'0EFA'
SMT2CPR          EQU  H'0EFB'
SMT2CPRL         EQU  H'0EFB'
SMT2CPRH         EQU  H'0EFC'
SMT2CPRU         EQU  H'0EFD'
SMT2CPW          EQU  H'0EFE'
SMT2CPWL         EQU  H'0EFE'
SMT2CPWH         EQU  H'0EFF'
SMT2CPWU         EQU  H'0F00'
SMT2PR           EQU  H'0F01'
SMT2PRL          EQU  H'0F01'
SMT2PRH          EQU  H'0F02'
SMT2PRU          EQU  H'0F03'
SMT2CON0         EQU  H'0F04'
SMT2CON1         EQU  H'0F05'
SMT2STAT         EQU  H'0F06'
SMT2CLK          EQU  H'0F07'
SMT2SIG          EQU  H'0F08'
SMT2WIN          EQU  H'0F09'
SMT1TMR          EQU  H'0F0A'
SMT1TMRL         EQU  H'0F0A'
SMT1TMRH         EQU  H'0F0B'
SMT1TMRU         EQU  H'0F0C'
SMT1CPR          EQU  H'0F0D'
SMT1CPRL         EQU  H'0F0D'
SMT1CPRH         EQU  H'0F0E'
SMT1CPRU         EQU  H'0F0F'
SMT1CPW          EQU  H'0F10'
SMT1CPWL         EQU  H'0F10'
SMT1CPWH         EQU  H'0F11'
SMT1CPWU         EQU  H'0F12'
SMT1PR           EQU  H'0F13'
SMT1PRL          EQU  H'0F13'
SMT1PRH          EQU  H'0F14'
SMT1PRU          EQU  H'0F15'
SMT1CON0         EQU  H'0F16'
SMT1CON1         EQU  H'0F17'
SMT1STAT         EQU  H'0F18'
SMT1CLK          EQU  H'0F19'
SMT1SIG          EQU  H'0F1A'
SMT1WIN          EQU  H'0F1B'
CCPR5            EQU  H'0F1C'
CCPR5L           EQU  H'0F1C'
CCPR5H           EQU  H'0F1D'
CCP5CON          EQU  H'0F1E'
CCP5CAP          EQU  H'0F1F'
CCPR4            EQU  H'0F20'
CCPR4L           EQU  H'0F20'
CCPR4H           EQU  H'0F21'
CCP4CON          EQU  H'0F22'
CCP4CAP          EQU  H'0F23'
CCPR3            EQU  H'0F24'
CCPR3L           EQU  H'0F24'
CCPR3H           EQU  H'0F25'
CCP3CON          EQU  H'0F26'
CCP3CAP          EQU  H'0F27'
T8TMR            EQU  H'0F28'
TMR8             EQU  H'0F28'
PR8              EQU  H'0F29'
T8PR             EQU  H'0F29'
T8CON            EQU  H'0F2A'
T8HLT            EQU  H'0F2B'
T8CLKCON         EQU  H'0F2C'
T8RST            EQU  H'0F2D'
TMR7L            EQU  H'0F2E'
TMR7H            EQU  H'0F2F'
T7CON            EQU  H'0F30'
PR7              EQU  H'0F31'
T7GCON           EQU  H'0F31'
T7GATE           EQU  H'0F32'
TMR7GATE         EQU  H'0F32'
T7CLK            EQU  H'0F33'
TMR7CLK          EQU  H'0F33'
CLKRCON          EQU  H'0F34'
CLKRCLK          EQU  H'0F35'
CWG1CLKCON       EQU  H'0F36'
CWG1ISM          EQU  H'0F37'
CWG1DBR          EQU  H'0F38'
CWG1DBF          EQU  H'0F39'
CWG1CON0         EQU  H'0F3A'
CWG1CON1         EQU  H'0F3B'
CWG1AS0          EQU  H'0F3C'
CWG1AS1          EQU  H'0F3D'
CWG1STR          EQU  H'0F3E'
CRCDATA          EQU  H'0F3F'
CRCDATL          EQU  H'0F3F'
CRCDATH          EQU  H'0F40'
CRCACC           EQU  H'0F41'
CRCACCL          EQU  H'0F41'
CRCACCH          EQU  H'0F42'
CRCSHFT          EQU  H'0F43'
CRCSHIFTL        EQU  H'0F43'
CRCSHIFTH        EQU  H'0F44'
CRCXOR           EQU  H'0F45'
CRCXORL          EQU  H'0F45'
CRCXORH          EQU  H'0F46'
CRCCON0          EQU  H'0F47'
CRCCON1          EQU  H'0F48'
SCANLADR         EQU  H'0F49'
SCANLADRL        EQU  H'0F49'
SCANLADRH        EQU  H'0F4A'
SCANLADRU        EQU  H'0F4B'
SCANHADR         EQU  H'0F4C'
SCANHADRL        EQU  H'0F4C'
SCANHADRH        EQU  H'0F4D'
SCANHADRU        EQU  H'0F4E'
SCANCON0         EQU  H'0F4F'
SCANTRIG         EQU  H'0F50'
MDCON0           EQU  H'0F51'
MDCON1           EQU  H'0F52'
MDSRC            EQU  H'0F53'
MDCARL           EQU  H'0F54'
MDCARH           EQU  H'0F55'
ADACT            EQU  H'0F56'
ADCLK            EQU  H'0F57'
ADREF            EQU  H'0F58'
ADCON1           EQU  H'0F59'
ADCON2           EQU  H'0F5A'
ADCON3           EQU  H'0F5B'
ADACQ            EQU  H'0F5C'
ADCAP            EQU  H'0F5D'
ADPRE            EQU  H'0F5E'
ADPCH            EQU  H'0F5F'
ADCON0           EQU  H'0F60'
ADPREV           EQU  H'0F61'
ADPREVL          EQU  H'0F61'
ADPREVH          EQU  H'0F62'
ADRES            EQU  H'0F63'
ADRESL           EQU  H'0F63'
ADRESH           EQU  H'0F64'
ADSTAT           EQU  H'0F65'
ADRPT            EQU  H'0F66'
ADCNT            EQU  H'0F67'
ADSTPT           EQU  H'0F68'
ADSTPTL          EQU  H'0F68'
ADSTPTH          EQU  H'0F69'
ADLTH            EQU  H'0F6A'
ADLTHL           EQU  H'0F6A'
ADLTHH           EQU  H'0F6B'
ADUTH            EQU  H'0F6C'
ADUTHL           EQU  H'0F6C'
ADUTHH           EQU  H'0F6D'
ADERR            EQU  H'0F6E'
ADERRL           EQU  H'0F6E'
ADERRH           EQU  H'0F6F'
ADACC            EQU  H'0F70'
ADACCL           EQU  H'0F70'
ADACCH           EQU  H'0F71'
ADFLTR           EQU  H'0F72'
ADFLTRL          EQU  H'0F72'
ADFLTRH          EQU  H'0F73'
NVMADR           EQU  H'0F74'
NVMADRL          EQU  H'0F74'
NVMADRH          EQU  H'0F75'
NVMDAT           EQU  H'0F76'
NVMCON1          EQU  H'0F77'
NVMCON2          EQU  H'0F78'
LATA             EQU  H'0F79'
LATB             EQU  H'0F7A'
LATC             EQU  H'0F7B'
LATD             EQU  H'0F7C'
LATE             EQU  H'0F7D'
LATF             EQU  H'0F7E'
LATG             EQU  H'0F7F'
LATH             EQU  H'0F80'
DDRA             EQU  H'0F81'
TRISA            EQU  H'0F81'
DDRB             EQU  H'0F82'
TRISB            EQU  H'0F82'
DDRC             EQU  H'0F83'
TRISC            EQU  H'0F83'
DDRD             EQU  H'0F84'
TRISD            EQU  H'0F84'
DDRE             EQU  H'0F85'
TRISE            EQU  H'0F85'
TRISF            EQU  H'0F86'
TRISG            EQU  H'0F87'
TRISH            EQU  H'0F88'
PORTA            EQU  H'0F89'
PORTB            EQU  H'0F8A'
PORTC            EQU  H'0F8B'
PORTD            EQU  H'0F8C'
PORTE            EQU  H'0F8D'
PORTF            EQU  H'0F8E'
PORTG            EQU  H'0F8F'
PORTH            EQU  H'0F90'
SSP1BUF          EQU  H'0F91'
SSP1ADD          EQU  H'0F92'
SSP1MSK          EQU  H'0F93'
SSP1STAT         EQU  H'0F94'
SSP1CON1         EQU  H'0F95'
SSP1CON2         EQU  H'0F96'
SSP1CON3         EQU  H'0F97'
RC1REG           EQU  H'0F98'
RCREG1           EQU  H'0F98'
TX1REG           EQU  H'0F99'
TXREG1           EQU  H'0F99'
SP1BRG           EQU  H'0F9A'
SP1BRGL          EQU  H'0F9A'
SPBRG1           EQU  H'0F9A'
SP1BRGH          EQU  H'0F9B'
SPBRGH1          EQU  H'0F9B'
RC1STA           EQU  H'0F9C'
RCSTA1           EQU  H'0F9C'
TX1STA           EQU  H'0F9D'
TXSTA1           EQU  H'0F9D'
BAUD1CON         EQU  H'0F9E'
BAUDCON1         EQU  H'0F9E'
BAUDCTL1         EQU  H'0F9E'
PWM7DCL          EQU  H'0F9F'
PWM7DCH          EQU  H'0FA0'
PWM7CON          EQU  H'0FA1'
PWM6DCL          EQU  H'0FA2'
PWM6DCH          EQU  H'0FA3'
PWM6CON          EQU  H'0FA4'
CCPR2            EQU  H'0FA5'
CCPR2L           EQU  H'0FA5'
CCPR2H           EQU  H'0FA6'
CCP2CON          EQU  H'0FA7'
CCP2CAP          EQU  H'0FA8'
CCPR1            EQU  H'0FA9'
CCPR1L           EQU  H'0FA9'
CCPR1H           EQU  H'0FAA'
CCP1CON          EQU  H'0FAB'
CCP1CAP          EQU  H'0FAC'
CCPTMRS0         EQU  H'0FAD'
CCPTMRS1         EQU  H'0FAE'
T6TMR            EQU  H'0FAF'
TMR6             EQU  H'0FAF'
PR6              EQU  H'0FB0'
T6PR             EQU  H'0FB0'
T6CON            EQU  H'0FB1'
T6HLT            EQU  H'0FB2'
T6CLKCON         EQU  H'0FB3'
T6RST            EQU  H'0FB4'
T4TMR            EQU  H'0FB5'
TMR4             EQU  H'0FB5'
PR4              EQU  H'0FB6'
T4PR             EQU  H'0FB6'
T4CON            EQU  H'0FB7'
T4HLT            EQU  H'0FB8'
T4CLKCON         EQU  H'0FB9'
T4RST            EQU  H'0FBA'
T2TMR            EQU  H'0FBB'
TMR2             EQU  H'0FBB'
PR2              EQU  H'0FBC'
T2PR             EQU  H'0FBC'
T2CON            EQU  H'0FBD'
T2HLT            EQU  H'0FBE'
T2CLKCON         EQU  H'0FBF'
T2RST            EQU  H'0FC0'
TMR5L            EQU  H'0FC1'
TMR5H            EQU  H'0FC2'
T5CON            EQU  H'0FC3'
PR5              EQU  H'0FC4'
T5GCON           EQU  H'0FC4'
T5GATE           EQU  H'0FC5'
TMR5GATE         EQU  H'0FC5'
T5CLK            EQU  H'0FC6'
TMR5CLK          EQU  H'0FC6'
TMR3L            EQU  H'0FC7'
TMR3H            EQU  H'0FC8'
T3CON            EQU  H'0FC9'
PR3              EQU  H'0FCA'
T3GCON           EQU  H'0FCA'
T3GATE           EQU  H'0FCB'
TMR3GATE         EQU  H'0FCB'
T3CLK            EQU  H'0FCC'
TMR3CLK          EQU  H'0FCC'
TMR1L            EQU  H'0FCD'
TMR1H            EQU  H'0FCE'
T1CON            EQU  H'0FCF'
PR1              EQU  H'0FD0'
T1GCON           EQU  H'0FD0'
T1GATE           EQU  H'0FD1'
TMR1GATE         EQU  H'0FD1'
T1CLK            EQU  H'0FD2'
TMR1CLK          EQU  H'0FD2'
TMR0             EQU  H'0FD3'
TMR0L            EQU  H'0FD3'
PR0              EQU  H'0FD4'
TMR0H            EQU  H'0FD4'
T0CON0           EQU  H'0FD5'
T0CON1           EQU  H'0FD6'
PCON0            EQU  H'0FD7'
STATUS           EQU  H'0FD8'
FSR2L            EQU  H'0FD9'
FSR2H            EQU  H'0FDA'
PLUSW2           EQU  H'0FDB'
PREINC2          EQU  H'0FDC'
POSTDEC2         EQU  H'0FDD'
POSTINC2         EQU  H'0FDE'
INDF2            EQU  H'0FDF'
BSR              EQU  H'0FE0'
FSR1L            EQU  H'0FE1'
FSR1H            EQU  H'0FE2'
PLUSW1           EQU  H'0FE3'
PREINC1          EQU  H'0FE4'
POSTDEC1         EQU  H'0FE5'
POSTINC1         EQU  H'0FE6'
INDF1            EQU  H'0FE7'
WREG             EQU  H'0FE8'
FSR0L            EQU  H'0FE9'
FSR0H            EQU  H'0FEA'
PLUSW0           EQU  H'0FEB'
PREINC0          EQU  H'0FEC'
POSTDEC0         EQU  H'0FED'
POSTINC0         EQU  H'0FEE'
INDF0            EQU  H'0FEF'
INTCON           EQU  H'0FF2'
PROD             EQU  H'0FF3'
PRODL            EQU  H'0FF3'
PRODH            EQU  H'0FF4'
TABLAT           EQU  H'0FF5'
TBLPTR           EQU  H'0FF6'
TBLPTRL          EQU  H'0FF6'
TBLPTRH          EQU  H'0FF7'
TBLPTRU          EQU  H'0FF8'
PC               EQU  H'0FF9'
PCL              EQU  H'0FF9'
PCLATH           EQU  H'0FFA'
PCLATU           EQU  H'0FFB'
STKPTR           EQU  H'0FFC'
TOS              EQU  H'0FFD'
TOSL             EQU  H'0FFD'
TOSH             EQU  H'0FFE'
TOSU             EQU  H'0FFF'

;----- PPSLOCK Bits -----------------------------------------------------
PPSLOCKED        EQU  H'0000'


;----- INT0PPS Bits -----------------------------------------------------
INT0PPS0         EQU  H'0000'
INT0PPS1         EQU  H'0001'
INT0PPS2         EQU  H'0002'
INT0PPS3         EQU  H'0003'
INT0PPS4         EQU  H'0004'
INT0PPS5         EQU  H'0005'


;----- INT1PPS Bits -----------------------------------------------------
INT1PPS0         EQU  H'0000'
INT1PPS1         EQU  H'0001'
INT1PPS2         EQU  H'0002'
INT1PPS3         EQU  H'0003'
INT1PPS4         EQU  H'0004'
INT1PPS5         EQU  H'0005'


;----- INT2PPS Bits -----------------------------------------------------
INT2PPS0         EQU  H'0000'
INT2PPS1         EQU  H'0001'
INT2PPS2         EQU  H'0002'
INT2PPS3         EQU  H'0003'
INT2PPS4         EQU  H'0004'
INT2PPS5         EQU  H'0005'


;----- INT3PPS Bits -----------------------------------------------------
INT3PPS0         EQU  H'0000'
INT3PPS1         EQU  H'0001'
INT3PPS2         EQU  H'0002'
INT3PPS3         EQU  H'0003'
INT3PPS4         EQU  H'0004'
INT3PPS5         EQU  H'0005'


;----- T0CKIPPS Bits -----------------------------------------------------
T0CKIPPS0        EQU  H'0000'
T0CKIPPS1        EQU  H'0001'
T0CKIPPS2        EQU  H'0002'
T0CKIPPS3        EQU  H'0003'
T0CKIPPS4        EQU  H'0004'
T0CKIPPS5        EQU  H'0005'


;----- T1CKIPPS Bits -----------------------------------------------------
T1CKIPPS0        EQU  H'0000'
T1CKIPPS1        EQU  H'0001'
T1CKIPPS2        EQU  H'0002'
T1CKIPPS3        EQU  H'0003'
T1CKIPPS4        EQU  H'0004'
T1CKIPPS5        EQU  H'0005'


;----- T1GPPS Bits -----------------------------------------------------
T1GPPS0          EQU  H'0000'
T1GPPS1          EQU  H'0001'
T1GPPS2          EQU  H'0002'
T1GPPS3          EQU  H'0003'
T1GPPS4          EQU  H'0004'
T1GPPS5          EQU  H'0005'


;----- T3CKIPPS Bits -----------------------------------------------------
T3CKIPPS0        EQU  H'0000'
T3CKIPPS1        EQU  H'0001'
T3CKIPPS2        EQU  H'0002'
T3CKIPPS3        EQU  H'0003'
T3CKIPPS4        EQU  H'0004'
T3CKIPPS5        EQU  H'0005'


