PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p18f67k40.inc
CCP3CTS0         EQU  H'0000'
CCP3CTS1         EQU  H'0001'
CCP3CTS2         EQU  H'0002'
CCP3CTS3         EQU  H'0003'
CCP3CTS4         EQU  H'0004'
CCP3CTS5         EQU  H'0005'
CCP3CTS6         EQU  H'0006'
CCP3CTS7         EQU  H'0007'


;----- T8CON Bits -----------------------------------------------------
ON_T8CON         EQU  H'0007'

OUTPS0           EQU  H'0000'
OUTPS1           EQU  H'0001'
OUTPS2           EQU  H'0002'
OUTPS3           EQU  H'0003'
CKPS0            EQU  H'0004'
CKPS1            EQU  H'0005'
CKPS2            EQU  H'0006'

T8ON             EQU  H'0007'

T8OUTPS0         EQU  H'0000'
T8OUTPS1         EQU  H'0001'
T8OUTPS2         EQU  H'0002'
T8OUTPS3         EQU  H'0003'
T8CKPS0          EQU  H'0004'
T8CKPS1          EQU  H'0005'
T8CKPS2          EQU  H'0006'
TMR8ON           EQU  H'0007'


;----- T8HLT Bits -----------------------------------------------------
CKSYNC           EQU  H'0005'
CKPOL            EQU  H'0006'
PSYNC            EQU  H'0007'

MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
MODE3            EQU  H'0003'
MODE4            EQU  H'0004'

T8CKSYNC         EQU  H'0005'
T8CKPOL          EQU  H'0006'
T8PSYNC          EQU  H'0007'

T8MODE0          EQU  H'0000'
T8MODE1          EQU  H'0001'
T8MODE2          EQU  H'0002'
T8MODE3          EQU  H'0003'
T8MODE4          EQU  H'0004'


;----- T8CLKCON Bits -----------------------------------------------------
CS0_T8CLKCON     EQU  H'0000'
CS1_T8CLKCON     EQU  H'0001'
CS2_T8CLKCON     EQU  H'0002'
CS3              EQU  H'0003'


T8CS0            EQU  H'0000'
T8CS1            EQU  H'0001'
T8CS2            EQU  H'0002'
T8CS3            EQU  H'0003'


;----- T8RST Bits -----------------------------------------------------
RSEL0            EQU  H'0000'
RSEL1            EQU  H'0001'
RSEL2            EQU  H'0002'
RSEL3            EQU  H'0003'


T8RSEL0          EQU  H'0000'
T8RSEL1          EQU  H'0001'
T8RSEL2          EQU  H'0002'
T8RSEL3          EQU  H'0003'


;----- TMR7L Bits -----------------------------------------------------
TMR7L0           EQU  H'0000'
TMR7L1           EQU  H'0001'
TMR7L2           EQU  H'0002'
TMR7L3           EQU  H'0003'
TMR7L4           EQU  H'0004'
TMR7L5           EQU  H'0005'
TMR7L6           EQU  H'0006'
TMR7L7           EQU  H'0007'



;----- TMR7H Bits -----------------------------------------------------
TMR7H0           EQU  H'0000'
TMR7H1           EQU  H'0001'
TMR7H2           EQU  H'0002'
TMR7H3           EQU  H'0003'
TMR7H4           EQU  H'0004'
TMR7H5           EQU  H'0005'
TMR7H6           EQU  H'0006'
TMR7H7           EQU  H'0007'



;----- T7CON Bits -----------------------------------------------------
ON_T7CON         EQU  H'0000'
RD16             EQU  H'0001'
NOT_SYNC         EQU  H'0002'

TMR7ON           EQU  H'0000'
T7RD16           EQU  H'0001'
NOT_T7SYNC       EQU  H'0002'
T7CKPS0          EQU  H'0004'
T7CKPS1          EQU  H'0005'

CKPS0            EQU  H'0004'
CKPS1            EQU  H'0005'


;----- PR7 Bits -----------------------------------------------------
GVAL             EQU  H'0002'
GGO_NOT_DONE     EQU  H'0003'
GSPM             EQU  H'0004'
GTM              EQU  H'0005'
GPOL             EQU  H'0006'
GE               EQU  H'0007'

T7GVAL           EQU  H'0002'
T7GGO_NOT_DONE   EQU  H'0003'
T7GSPM           EQU  H'0004'
T7GTM            EQU  H'0005'
T7GPOL           EQU  H'0006'
T7GE             EQU  H'0007'

T7GGO            EQU  H'0003'


;----- T7GCON Bits -----------------------------------------------------
GVAL             EQU  H'0002'
GGO_NOT_DONE     EQU  H'0003'
GSPM             EQU  H'0004'
GTM              EQU  H'0005'
GPOL             EQU  H'0006'
GE               EQU  H'0007'

T7GVAL           EQU  H'0002'
T7GGO_NOT_DONE   EQU  H'0003'
T7GSPM           EQU  H'0004'
T7GTM            EQU  H'0005'
T7GPOL           EQU  H'0006'
T7GE             EQU  H'0007'

T7GGO            EQU  H'0003'


;----- T7GATE Bits -----------------------------------------------------
GSS0             EQU  H'0000'
GSS1             EQU  H'0001'
GSS2             EQU  H'0002'
GSS3             EQU  H'0003'
GSS4             EQU  H'0004'

T7GSS0           EQU  H'0000'
T7GSS1           EQU  H'0001'
T7GSS2           EQU  H'0002'
T7GSS3           EQU  H'0003'
T7GSS4           EQU  H'0004'


;----- TMR7GATE Bits -----------------------------------------------------
GSS0             EQU  H'0000'
GSS1             EQU  H'0001'
GSS2             EQU  H'0002'
GSS3             EQU  H'0003'
GSS4             EQU  H'0004'

T7GSS0           EQU  H'0000'
T7GSS1           EQU  H'0001'
T7GSS2           EQU  H'0002'
T7GSS3           EQU  H'0003'
T7GSS4           EQU  H'0004'


;----- T7CLK Bits -----------------------------------------------------
T7CS0            EQU  H'0000'
T7CS1            EQU  H'0001'
T7CS2            EQU  H'0002'
T7CS3            EQU  H'0003'

CS0_T7CLK        EQU  H'0000'
CS1_T7CLK        EQU  H'0001'
CS2_T7CLK        EQU  H'0002'
CS3              EQU  H'0003'


;----- TMR7CLK Bits -----------------------------------------------------
T7CS0            EQU  H'0000'
T7CS1            EQU  H'0001'
T7CS2            EQU  H'0002'
T7CS3            EQU  H'0003'

CS0_TMR7CLK      EQU  H'0000'
CS1_TMR7CLK      EQU  H'0001'
CS2_TMR7CLK      EQU  H'0002'
CS3              EQU  H'0003'


;----- CLKRCON Bits -----------------------------------------------------
EN               EQU  H'0007'

CLKRDIV0         EQU  H'0000'
CLKRDIV1         EQU  H'0001'
CLKRDIV2         EQU  H'0002'
CLKRDC0          EQU  H'0003'
CLKRDC1          EQU  H'0004'
CLKREN           EQU  H'0007'

DIV0             EQU  H'0000'
DIV1             EQU  H'0001'
DIV2             EQU  H'0002'
DC0_CLKRCON      EQU  H'0003'
DC1_CLKRCON      EQU  H'0004'


;----- CLKRCLK Bits -----------------------------------------------------
CLKRCLK0         EQU  H'0000'
CLKRCLK1         EQU  H'0001'
CLKRCLK2         EQU  H'0002'

CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'


;----- CWG1CLKCON Bits -----------------------------------------------------
CS               EQU  H'0000'

CWG1CS           EQU  H'0000'


;----- CWG1ISM Bits -----------------------------------------------------
CWG1ISM0         EQU  H'0000'
CWG1ISM1         EQU  H'0001'
CWG1ISM2         EQU  H'0002'
CWG1ISM3         EQU  H'0003'


;----- CWG1DBR Bits -----------------------------------------------------
DBR0             EQU  H'0000'
DBR1             EQU  H'0001'
DBR2             EQU  H'0002'
DBR3             EQU  H'0003'
DBR4             EQU  H'0004'
DBR5             EQU  H'0005'


CWG1DBR0         EQU  H'0000'
CWG1DBR1         EQU  H'0001'
CWG1DBR2         EQU  H'0002'
CWG1DBR3         EQU  H'0003'
CWG1DBR4         EQU  H'0004'
CWG1DBR5         EQU  H'0005'


